xiaopaoya/JellyFrame/ports/esp32p4-idf/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# WT9932P4-TINY on COM22 is ESP32-P4 v1.3. IDF v5.5 defaults to the
# incompatible v3.x hardware line, so select the documented 0.x/1.x line.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_JELLYFRAME_P4_ACCEL_SMOKE=y
